---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsRunStyle
source: html/1dc06f71-259c-1fb1-2fd7-6fa449f628e0.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunStyle

The shape of a run. Different shape has different ways of manipulation.

## Syntax (C#)
```csharp
public enum StairsRunStyle
```